#ضمن <stdio.h>
/* maximum subarray sum, divide and conquer */
صحيح سڀ_کان_وڏو(صحيح پهريون, صحيح ٻيو) { أرجع پهريون > ٻيو ? پهريون : ٻيو; }
صحيح پار(صحيح قدرون[], صحيح هيٺيون, صحيح وچ, صحيح مٿاهون) {
  صحيح جوڙ = 0, کاٻو = -100000, ساڄو = -100000;
  لكل (صحيح index = وچ; index >= هيٺيون; index--) { جوڙ += قدرون[index]; کاٻو = سڀ_کان_وڏو(کاٻو, جوڙ); }
  جوڙ = 0;
  لكل (صحيح index = وچ + 1; index <= مٿاهون; index++) { جوڙ += قدرون[index]; ساڄو = سڀ_کان_وڏو(ساڄو, جوڙ); }
  أرجع کاٻو + ساڄو;
}
صحيح بهترين(صحيح قدرون[], صحيح هيٺيون, صحيح مٿاهون) {
  إذا (هيٺيون == مٿاهون) أرجع قدرون[هيٺيون];
  صحيح وچ = (هيٺيون + مٿاهون) / 2;
  أرجع سڀ_کان_وڏو(سڀ_کان_وڏو(بهترين(قدرون, هيٺيون, وچ), بهترين(قدرون, وچ + 1, مٿاهون)), پار(قدرون, هيٺيون, وچ, مٿاهون));
}
صحيح مکيه(فراغ) { صحيح قدرون[] = {-2, 1, -3, 4, -1, 2, 1, -5, 4}; لکو("%d\n", بهترين(قدرون, 0, 8)); أرجع 0; }
