#अन्तर्भाव <stdio.h>
/* linear algebra: LU decomposition (Doolittle) of a 3 by 3 matrix */
पूर्णाङ्क मुख्यम्(शून्य) {
  द्विगुण आव्यूहः[3][3] = {{2, -1, -2}, {-4, 6, 3}, {-4, -2, 8}}, अधस्तनम्[3][3] = {{0}}, ऊर्ध्वस्थम्[3][3] = {{0}};
  प्रति (पूर्णाङ्क पङ्क्तिका = 0; पङ्क्तिका < 3; पङ्क्तिका++) {
    प्रति (पूर्णाङ्क स्तम्भः_2 = पङ्क्तिका; स्तम्भः_2 < 3; स्तम्भः_2++) {
      द्विगुण योगफलम् = 0;
      प्रति (पूर्णाङ्क index = 0; index < पङ्क्तिका; index++) योगफलम् += अधस्तनम्[पङ्क्तिका][index] * ऊर्ध्वस्थम्[index][स्तम्भः_2];
      ऊर्ध्वस्थम्[पङ्क्तिका][स्तम्भः_2] = आव्यूहः[पङ्क्तिका][स्तम्भः_2] - योगफलम्;
    }
    अधस्तनम्[पङ्क्तिका][पङ्क्तिका] = 1;
    प्रति (पूर्णाङ्क अधः = पङ्क्तिका + 1; अधः < 3; अधः++) {
      द्विगुण योगफलम् = 0;
      प्रति (पूर्णाङ्क index = 0; index < पङ्क्तिका; index++) योगफलम् += अधस्तनम्[अधः][index] * ऊर्ध्वस्थम्[index][पङ्क्तिका];
      अधस्तनम्[अधः][पङ्क्तिका] = (आव्यूहः[अधः][पङ्क्तिका] - योगफलम्) / ऊर्ध्वस्थम्[पङ्क्तिका][पङ्क्तिका];
    }
  }
  प्रति (पूर्णाङ्क पङ्क्तिका = 0; पङ्क्तिका < 3; पङ्क्तिका++) प्रारूप_लिख("%g %g %g | %g %g %g\n", अधस्तनम्[पङ्क्तिका][0], अधस्तनम्[पङ्क्तिका][1], अधस्तनम्[पङ्क्तिका][2], ऊर्ध्वस्थम्[पङ्क्तिका][0], ऊर्ध्वस्थम्[पङ्क्तिका][1], ऊर्ध्वस्थम्[पङ्क्तिका][2]);
  प्रत्यागम 0;
}
