#ਅਨ੍ਤਰ੍ਭਾਵ <stdio.h>
/* topological sort, Kahn's algorithm */
ਪੂਰਨ ਮੁੱਖ(ਖਾਲੀ) {
  ਪੂਰਨ ਕਿਨਾਰੇ[6][6] = {{0},{0},{0,0,0,1},{0,1},{1,1},{1,0,1}}, ਅੰਦਰਲੀ_ਡਿਗਰੀ[6] = {0}, ਕਤਾਰ[6], ਸਿਰ = 0, ਪੂਛ = 0;
  ਲਈ (ਪੂਰਨ from = 0; from < 6; from++) ਲਈ (ਪੂਰਨ ਮੰਜ਼ਿਲ = 0; ਮੰਜ਼ਿਲ < 6; ਮੰਜ਼ਿਲ++) ਅੰਦਰਲੀ_ਡਿਗਰੀ[ਮੰਜ਼ਿਲ] += ਕਿਨਾਰੇ[from][ਮੰਜ਼ਿਲ];
  ਲਈ (ਪੂਰਨ ਸ਼ੀਰਸ਼ = 0; ਸ਼ੀਰਸ਼ < 6; ਸ਼ੀਰਸ਼++) ਜੇ (!ਅੰਦਰਲੀ_ਡਿਗਰੀ[ਸ਼ੀਰਸ਼]) ਕਤਾਰ[ਪੂਛ++] = ਸ਼ੀਰਸ਼;
  ਜਦੋਂ (ਸਿਰ < ਪੂਛ) {
    ਪੂਰਨ ਸ਼ੀਰਸ਼ = ਕਤਾਰ[ਸਿਰ++];
    ਲਿਖੋ("%d ", ਸ਼ੀਰਸ਼);
    ਲਈ (ਪੂਰਨ ਮੰਜ਼ਿਲ = 0; ਮੰਜ਼ਿਲ < 6; ਮੰਜ਼ਿਲ++) ਜੇ (ਕਿਨਾਰੇ[ਸ਼ੀਰਸ਼][ਮੰਜ਼ਿਲ] && --ਅੰਦਰਲੀ_ਡਿਗਰੀ[ਮੰਜ਼ਿਲ] == 0) ਕਤਾਰ[ਪੂਛ++] = ਮੰਜ਼ਿਲ;
  }
  ਲਿਖੋ("\n");
  ਵਾਪਸ 0;
}
