#ضمن <stdio.h>
/* topological sort, Kahn's algorithm */
صحيح اصلي(فراغ) {
  صحيح څنډې[6][6] = {{0},{0},{0,0,0,1},{0,1},{1,1},{1,0,1}}, ننوتونکې_درجه[6] = {0}, کتار[6], سر = 0, لکۍ = 0;
  لكل (صحيح from = 0; from < 6; from++) لكل (صحيح منزل = 0; منزل < 6; منزل++) ننوتونکې_درجه[منزل] += څنډې[from][منزل];
  لكل (صحيح راس = 0; راس < 6; راس++) إذا (!ننوتونکې_درجه[راس]) کتار[لکۍ++] = راس;
  طالما (سر < لکۍ) {
    صحيح راس = کتار[سر++];
    چاپ_کړه("%d ", راس);
    لكل (صحيح منزل = 0; منزل < 6; منزل++) إذا (څنډې[راس][منزل] && --ننوتونکې_درجه[منزل] == 0) کتار[لکۍ++] = منزل;
  }
  چاپ_کړه("\n");
  أرجع 0;
}
