#अन्तर्भाव <stdio.h>
/* heap sort with a max heap */
शून्य शोधय_अधस्तात्(पूर्णाङ्क मूल्यानि[], पूर्णाङ्क आकारः, पूर्णाङ्क मूलम्) {
  पूर्णाङ्क बृहत्तमम् = मूलम्, वाम = 2 * मूलम् + 1, दक्षिण = 2 * मूलम् + 2;
  यदि (वाम < आकारः && मूल्यानि[वाम] > मूल्यानि[बृहत्तमम्]) बृहत्तमम् = वाम;
  यदि (दक्षिण < आकारः && मूल्यानि[दक्षिण] > मूल्यानि[बृहत्तमम्]) बृहत्तमम् = दक्षिण;
  यदि (बृहत्तमम् != मूलम्) { पूर्णाङ्क अस्थायी = मूल्यानि[मूलम्]; मूल्यानि[मूलम्] = मूल्यानि[बृहत्तमम्]; मूल्यानि[बृहत्तमम्] = अस्थायी; शोधय_अधस्तात्(मूल्यानि, आकारः, बृहत्तमम्); }
}
पूर्णाङ्क मुख्यम्(शून्य) {
  पूर्णाङ्क मूल्यानि[] = {12, 11, 13, 5, 6, 7}, गणना_2 = 6;
  प्रति (पूर्णाङ्क मूलम् = गणना_2 / 2 - 1; मूलम् >= 0; मूलम्--) शोधय_अधस्तात्(मूल्यानि, गणना_2, मूलम्);
  प्रति (पूर्णाङ्क चरमः = गणना_2 - 1; चरमः > 0; चरमः--) {
    पूर्णाङ्क अस्थायी = मूल्यानि[0]; मूल्यानि[0] = मूल्यानि[चरमः]; मूल्यानि[चरमः] = अस्थायी;
    शोधय_अधस्तात्(मूल्यानि, चरमः, 0);
  }
  प्रति (पूर्णाङ्क index = 0; index < गणना_2; index++) प्रारूप_लिख("%d ", मूल्यानि[index]);
  प्रारूप_लिख("\n");
  प्रत्यागम 0;
}
