#अन्तर्भाव <stdio.h>
/* merge sort, top down */
शून्य संयोजय(पूर्णाङ्क मूल्यानि[], पूर्णाङ्क वाम, पूर्णाङ्क मध्यम्, पूर्णाङ्क दक्षिण) {
  पूर्णाङ्क अस्थायी[64], प्रथमम् = वाम, द्वितीयम् = मध्यम् + 1, अग्रिमः = 0;
  यावत् (प्रथमम् <= मध्यम् && द्वितीयम् <= दक्षिण) अस्थायी[अग्रिमः++] = मूल्यानि[प्रथमम्] <= मूल्यानि[द्वितीयम्] ? मूल्यानि[प्रथमम्++] : मूल्यानि[द्वितीयम्++];
  यावत् (प्रथमम् <= मध्यम्) अस्थायी[अग्रिमः++] = मूल्यानि[प्रथमम्++];
  यावत् (द्वितीयम् <= दक्षिण) अस्थायी[अग्रिमः++] = मूल्यानि[द्वितीयम्++];
  प्रति (पूर्णाङ्क index = 0; index < अग्रिमः; index++) मूल्यानि[वाम + index] = अस्थायी[index];
}
शून्य संयोजय_क्रमय(पूर्णाङ्क मूल्यानि[], पूर्णाङ्क वाम, पूर्णाङ्क दक्षिण) {
  यदि (वाम >= दक्षिण) प्रत्यागम;
  पूर्णाङ्क मध्यम् = (वाम + दक्षिण) / 2;
  संयोजय_क्रमय(मूल्यानि, वाम, मध्यम्); संयोजय_क्रमय(मूल्यानि, मध्यम् + 1, दक्षिण); संयोजय(मूल्यानि, वाम, मध्यम्, दक्षिण);
}
पूर्णाङ्क मुख्यम्(शून्य) {
  पूर्णाङ्क मूल्यानि[] = {38, 27, 43, 3, 9, 82, 10}, गणना_2 = 7;
  संयोजय_क्रमय(मूल्यानि, 0, गणना_2 - 1);
  प्रति (पूर्णाङ्क index = 0; index < गणना_2; index++) प्रारूप_लिख("%d ", मूल्यानि[index]);
  प्रारूप_लिख("\n");
  प्रत्यागम 0;
}
