#ضمن <stdio.h>
/* linear algebra: LU decomposition (Doolittle) of a 3 by 3 matrix */
صحيح اصلي(فراغ) {
  مزدوج ماتریکس[3][3] = {{2, -1, -2}, {-4, 6, 3}, {-4, -2, 8}}, ښکتنی[3][3] = {{0}}, پاسنی[3][3] = {{0}};
  لكل (صحيح لیکه = 0; لیکه < 3; لیکه++) {
    لكل (صحيح ستون = لیکه; ستون < 3; ستون++) {
      مزدوج مجموعه = 0;
      لكل (صحيح index = 0; index < لیکه; index++) مجموعه += ښکتنی[لیکه][index] * پاسنی[index][ستون];
      پاسنی[لیکه][ستون] = ماتریکس[لیکه][ستون] - مجموعه;
    }
    ښکتنی[لیکه][لیکه] = 1;
    لكل (صحيح لاندې = لیکه + 1; لاندې < 3; لاندې++) {
      مزدوج مجموعه = 0;
      لكل (صحيح index = 0; index < لیکه; index++) مجموعه += ښکتنی[لاندې][index] * پاسنی[index][لیکه];
      ښکتنی[لاندې][لیکه] = (ماتریکس[لاندې][لیکه] - مجموعه) / پاسنی[لیکه][لیکه];
    }
  }
  لكل (صحيح لیکه = 0; لیکه < 3; لیکه++) چاپ_کړه("%g %g %g | %g %g %g\n", ښکتنی[لیکه][0], ښکتنی[لیکه][1], ښکتنی[لیکه][2], پاسنی[لیکه][0], پاسنی[لیکه][1], پاسنی[لیکه][2]);
  أرجع 0;
}
