#अन्तर्भाव <stdio.h>
#अन्तर्भाव <string.h>
/* longest common subsequence length */
पूर्णाङ्क मुख्यम्(शून्य) {
  वर्ण प्रथमम्[] = "AGGTAB", द्वितीयम्[] = "GXTXAYB";
  पूर्णाङ्क पङ्क्तिकाः = वाक्यदैर्घ्यम्(प्रथमम्), स्तम्भसङ्ख्या = वाक्यदैर्घ्यम्(द्वितीयम्), सारणी[16][16] = {{0}};
  प्रति (पूर्णाङ्क पङ्क्तिका = 1; पङ्क्तिका <= पङ्क्तिकाः; पङ्क्तिका++)
    प्रति (पूर्णाङ्क स्तम्भः_2 = 1; स्तम्भः_2 <= स्तम्भसङ्ख्या; स्तम्भः_2++)
      सारणी[पङ्क्तिका][स्तम्भः_2] = प्रथमम्[पङ्क्तिका - 1] == द्वितीयम्[स्तम्भः_2 - 1] ? सारणी[पङ्क्तिका - 1][स्तम्भः_2 - 1] + 1
                      : (सारणी[पङ्क्तिका - 1][स्तम्भः_2] > सारणी[पङ्क्तिका][स्तम्भः_2 - 1] ? सारणी[पङ्क्तिका - 1][स्तम्भः_2] : सारणी[पङ्क्तिका][स्तम्भः_2 - 1]);
  प्रारूप_लिख("%d\n", सारणी[पङ्क्तिकाः][स्तम्भसङ्ख्या]);
  प्रत्यागम 0;
}
