#अन्तर्भाव <stdio.h>
#अन्तर्भाव <limits.h>
/* matrix chain multiplication order */
पूर्णाङ्क मुख्यम्(शून्य) {
  पूर्णाङ्क आकारः[] = {40, 20, 30, 10, 30}, गणना_2 = 4, मूल्यव्ययः[8][8] = {{0}};
  प्रति (पूर्णाङ्क दैर्घ्यम् = 2; दैर्घ्यम् <= गणना_2; दैर्घ्यम्++)
    प्रति (पूर्णाङ्क प्रथमम् = 1; प्रथमम् + दैर्घ्यम् - 1 <= गणना_2; प्रथमम्++) {
      पूर्णाङ्क चरमः = प्रथमम् + दैर्घ्यम् - 1;
      मूल्यव्ययः[प्रथमम्][चरमः] = अधिकतम_पूर्णाङ्कः;
      प्रति (पूर्णाङ्क विभज = प्रथमम्; विभज < चरमः; विभज++) {
        पूर्णाङ्क योगः = मूल्यव्ययः[प्रथमम्][विभज] + मूल्यव्ययः[विभज + 1][चरमः] + आकारः[प्रथमम् - 1] * आकारः[विभज] * आकारः[चरमः];
        यदि (योगः < मूल्यव्ययः[प्रथमम्][चरमः]) मूल्यव्ययः[प्रथमम्][चरमः] = योगः;
      }
    }
  प्रारूप_लिख("%d\n", मूल्यव्ययः[1][गणना_2]);
  प्रत्यागम 0;
}
