#ضمن <stdio.h>
/* topological sort, Kahn's algorithm */
صحيح مکھ(فراغ) {
  صحيح کنارے[6][6] = {{0},{0},{0,0,0,1},{0,1},{1,1},{1,0,1}}, اندرلی_ڈگری[6] = {0}, قطار[6], سر = 0, پوچھ = 0;
  لكل (صحيح from = 0; from < 6; from++) لكل (صحيح منزل = 0; منزل < 6; منزل++) اندرلی_ڈگری[منزل] += کنارے[from][منزل];
  لكل (صحيح راس = 0; راس < 6; راس++) إذا (!اندرلی_ڈگری[راس]) قطار[پوچھ++] = راس;
  طالما (سر < پوچھ) {
    صحيح راس = قطار[سر++];
    لکھو("%d ", راس);
    لكل (صحيح منزل = 0; منزل < 6; منزل++) إذا (کنارے[راس][منزل] && --اندرلی_ڈگری[منزل] == 0) قطار[پوچھ++] = منزل;
  }
  لکھو("\n");
  أرجع 0;
}
