#ಅನ್ತರ್ಭಾವ <stdio.h>
/* merge sort, top down */
ಶೂನ್ಯ ವಿಲೀನ(ಪೂರ್ಣಾಂಕ ಮೌಲ್ಯಗಳು[], ಪೂರ್ಣಾಂಕ ಎಡಭಾಗ, ಪೂರ್ಣಾಂಕ ಮಧ್ಯ, ಪೂರ್ಣಾಂಕ ಬಲಭಾಗ) {
  ಪೂರ್ಣಾಂಕ ತಾತ್ಕಾಲಿಕ[64], ಮೊದಲ = ಎಡಭಾಗ, ಎರಡನೇ = ಮಧ್ಯ + 1, ಮುಂದಿನ = 0;
  ಆಗ (ಮೊದಲ <= ಮಧ್ಯ && ಎರಡನೇ <= ಬಲಭಾಗ) ತಾತ್ಕಾಲಿಕ[ಮುಂದಿನ++] = ಮೌಲ್ಯಗಳು[ಮೊದಲ] <= ಮೌಲ್ಯಗಳು[ಎರಡನೇ] ? ಮೌಲ್ಯಗಳು[ಮೊದಲ++] : ಮೌಲ್ಯಗಳು[ಎರಡನೇ++];
  ಆಗ (ಮೊದಲ <= ಮಧ್ಯ) ತಾತ್ಕಾಲಿಕ[ಮುಂದಿನ++] = ಮೌಲ್ಯಗಳು[ಮೊದಲ++];
  ಆಗ (ಎರಡನೇ <= ಬಲಭಾಗ) ತಾತ್ಕಾಲಿಕ[ಮುಂದಿನ++] = ಮೌಲ್ಯಗಳು[ಎರಡನೇ++];
  ಗಾಗಿ (ಪೂರ್ಣಾಂಕ index = 0; index < ಮುಂದಿನ; index++) ಮೌಲ್ಯಗಳು[ಎಡಭಾಗ + index] = ತಾತ್ಕಾಲಿಕ[index];
}
ಶೂನ್ಯ ವಿಲೀನ_ವಿಂಗಡಿಸು(ಪೂರ್ಣಾಂಕ ಮೌಲ್ಯಗಳು[], ಪೂರ್ಣಾಂಕ ಎಡಭಾಗ, ಪೂರ್ಣಾಂಕ ಬಲಭಾಗ) {
  ಆದರೆ (ಎಡಭಾಗ >= ಬಲಭಾಗ) ಹಿಂತಿರುಗಿ;
  ಪೂರ್ಣಾಂಕ ಮಧ್ಯ = (ಎಡಭಾಗ + ಬಲಭಾಗ) / 2;
  ವಿಲೀನ_ವಿಂಗಡಿಸು(ಮೌಲ್ಯಗಳು, ಎಡಭಾಗ, ಮಧ್ಯ); ವಿಲೀನ_ವಿಂಗಡಿಸು(ಮೌಲ್ಯಗಳು, ಮಧ್ಯ + 1, ಬಲಭಾಗ); ವಿಲೀನ(ಮೌಲ್ಯಗಳು, ಎಡಭಾಗ, ಮಧ್ಯ, ಬಲಭಾಗ);
}
ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ(ಶೂನ್ಯ) {
  ಪೂರ್ಣಾಂಕ ಮೌಲ್ಯಗಳು[] = {38, 27, 43, 3, 9, 82, 10}, ಎಣಿಕೆ_2 = 7;
  ವಿಲೀನ_ವಿಂಗಡಿಸು(ಮೌಲ್ಯಗಳು, 0, ಎಣಿಕೆ_2 - 1);
  ಗಾಗಿ (ಪೂರ್ಣಾಂಕ index = 0; index < ಎಣಿಕೆ_2; index++) ಬರೆ("%d ", ಮೌಲ್ಯಗಳು[index]);
  ಬರೆ("\n");
  ಹಿಂತಿರುಗಿ 0;
}
