#ಅನ್ತರ್ಭಾವ <stdio.h>
/* topological sort, Kahn's algorithm */
ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ(ಶೂನ್ಯ) {
  ಪೂರ್ಣಾಂಕ ಅಂಚುಗಳು[6][6] = {{0},{0},{0,0,0,1},{0,1},{1,1},{1,0,1}}, ಒಳ_ಡಿಗ್ರಿ[6] = {0}, ಸರತಿ[6], ತಲೆ = 0, ಬಾಲ = 0;
  ಗಾಗಿ (ಪೂರ್ಣಾಂಕ from = 0; from < 6; from++) ಗಾಗಿ (ಪೂರ್ಣಾಂಕ ಗಮ್ಯ = 0; ಗಮ್ಯ < 6; ಗಮ್ಯ++) ಒಳ_ಡಿಗ್ರಿ[ಗಮ್ಯ] += ಅಂಚುಗಳು[from][ಗಮ್ಯ];
  ಗಾಗಿ (ಪೂರ್ಣಾಂಕ ಶೃಂಗ = 0; ಶೃಂಗ < 6; ಶೃಂಗ++) ಆದರೆ (!ಒಳ_ಡಿಗ್ರಿ[ಶೃಂಗ]) ಸರತಿ[ಬಾಲ++] = ಶೃಂಗ;
  ಆಗ (ತಲೆ < ಬಾಲ) {
    ಪೂರ್ಣಾಂಕ ಶೃಂಗ = ಸರತಿ[ತಲೆ++];
    ಬರೆ("%d ", ಶೃಂಗ);
    ಗಾಗಿ (ಪೂರ್ಣಾಂಕ ಗಮ್ಯ = 0; ಗಮ್ಯ < 6; ಗಮ್ಯ++) ಆದರೆ (ಅಂಚುಗಳು[ಶೃಂಗ][ಗಮ್ಯ] && --ಒಳ_ಡಿಗ್ರಿ[ಗಮ್ಯ] == 0) ಸರತಿ[ಬಾಲ++] = ಗಮ್ಯ;
  }
  ಬರೆ("\n");
  ಹಿಂತಿರುಗಿ 0;
}
