#अन्तर्भाव <stdio.h>
/* topological sort, Kahn's algorithm */
पूर्णाङ्क मुख्यम्(शून्य) {
  पूर्णाङ्क धाराः[6][6] = {{0},{0},{0,0,0,1},{0,1},{1,1},{1,0,1}}, अन्तःकोटिः[6] = {0}, पङ्क्तिः[6], शिरः = 0, पुच्छम् = 0;
  प्रति (पूर्णाङ्क from = 0; from < 6; from++) प्रति (पूर्णाङ्क गन्तव्यम् = 0; गन्तव्यम् < 6; गन्तव्यम्++) अन्तःकोटिः[गन्तव्यम्] += धाराः[from][गन्तव्यम्];
  प्रति (पूर्णाङ्क शीर्षम् = 0; शीर्षम् < 6; शीर्षम्++) यदि (!अन्तःकोटिः[शीर्षम्]) पङ्क्तिः[पुच्छम्++] = शीर्षम्;
  यावत् (शिरः < पुच्छम्) {
    पूर्णाङ्क शीर्षम् = पङ्क्तिः[शिरः++];
    प्रारूप_लिख("%d ", शीर्षम्);
    प्रति (पूर्णाङ्क गन्तव्यम् = 0; गन्तव्यम् < 6; गन्तव्यम्++) यदि (धाराः[शीर्षम्][गन्तव्यम्] && --अन्तःकोटिः[गन्तव्यम्] == 0) पङ्क्तिः[पुच्छम्++] = गन्तव्यम्;
  }
  प्रारूप_लिख("\n");
  प्रत्यागम 0;
}
