#అన్తర్భావ <stdio.h>
/* topological sort, Kahn's algorithm */
పూర్ణాంకం ప్రధాన(శూన్య) {
  పూర్ణాంకం అంచులు[6][6] = {{0},{0},{0,0,0,1},{0,1},{1,1},{1,0,1}}, లోపలి_డిగ్రీ[6] = {0}, వరుస[6], తల = 0, తోక = 0;
  కొరకు (పూర్ణాంకం from = 0; from < 6; from++) కొరకు (పూర్ణాంకం గమ్యం = 0; గమ్యం < 6; గమ్యం++) లోపలి_డిగ్రీ[గమ్యం] += అంచులు[from][గమ్యం];
  కొరకు (పూర్ణాంకం శీర్షం = 0; శీర్షం < 6; శీర్షం++) ఒకవేళ (!లోపలి_డిగ్రీ[శీర్షం]) వరుస[తోక++] = శీర్షం;
  అయితే (తల < తోక) {
    పూర్ణాంకం శీర్షం = వరుస[తల++];
    రాయి("%d ", శీర్షం);
    కొరకు (పూర్ణాంకం గమ్యం = 0; గమ్యం < 6; గమ్యం++) ఒకవేళ (అంచులు[శీర్షం][గమ్యం] && --లోపలి_డిగ్రీ[గమ్యం] == 0) వరుస[తోక++] = గమ్యం;
  }
  రాయి("\n");
  తిరిగి 0;
}
