#ضمن <stdio.h>
/* merge sort, top down */
فراغ یوځای(صحيح ارزښتونه[], صحيح کیڼ_اړخ, صحيح منځ, صحيح ښی_اړخ) {
  صحيح لنډمهاله[64], لومړی = کیڼ_اړخ, دوهم = منځ + 1, بل = 0;
  طالما (لومړی <= منځ && دوهم <= ښی_اړخ) لنډمهاله[بل++] = ارزښتونه[لومړی] <= ارزښتونه[دوهم] ? ارزښتونه[لومړی++] : ارزښتونه[دوهم++];
  طالما (لومړی <= منځ) لنډمهاله[بل++] = ارزښتونه[لومړی++];
  طالما (دوهم <= ښی_اړخ) لنډمهاله[بل++] = ارزښتونه[دوهم++];
  لكل (صحيح index = 0; index < بل; index++) ارزښتونه[کیڼ_اړخ + index] = لنډمهاله[index];
}
فراغ یوځای_ترتیبول(صحيح ارزښتونه[], صحيح کیڼ_اړخ, صحيح ښی_اړخ) {
  إذا (کیڼ_اړخ >= ښی_اړخ) أرجع;
  صحيح منځ = (کیڼ_اړخ + ښی_اړخ) / 2;
  یوځای_ترتیبول(ارزښتونه, کیڼ_اړخ, منځ); یوځای_ترتیبول(ارزښتونه, منځ + 1, ښی_اړخ); یوځای(ارزښتونه, کیڼ_اړخ, منځ, ښی_اړخ);
}
صحيح اصلي(فراغ) {
  صحيح ارزښتونه[] = {38, 27, 43, 3, 9, 82, 10}, شمېر = 7;
  یوځای_ترتیبول(ارزښتونه, 0, شمېر - 1);
  لكل (صحيح index = 0; index < شمېر; index++) چاپ_کړه("%d ", ارزښتونه[index]);
  چاپ_کړه("\n");
  أرجع 0;
}
