#ಅನ್ತರ್ಭಾವ <stdio.h>
/* maximum subarray sum, divide and conquer */
ಪೂರ್ಣಾಂಕ ಅತಿದೊಡ್ಡ(ಪೂರ್ಣಾಂಕ ಮೊದಲ, ಪೂರ್ಣಾಂಕ ಎರಡನೇ) { ಹಿಂತಿರುಗಿ ಮೊದಲ > ಎರಡನೇ ? ಮೊದಲ : ಎರಡನೇ; }
ಪೂರ್ಣಾಂಕ ದಾಟುವಿಕೆ(ಪೂರ್ಣಾಂಕ ಮೌಲ್ಯಗಳು[], ಪೂರ್ಣಾಂಕ ಕೆಳಗಿನ, ಪೂರ್ಣಾಂಕ ಮಧ್ಯ, ಪೂರ್ಣಾಂಕ ಮೇಲಿನ) {
  ಪೂರ್ಣಾಂಕ ಮೊತ್ತ = 0, ಎಡಭಾಗ = -100000, ಬಲಭಾಗ = -100000;
  ಗಾಗಿ (ಪೂರ್ಣಾಂಕ index = ಮಧ್ಯ; index >= ಕೆಳಗಿನ; index--) { ಮೊತ್ತ += ಮೌಲ್ಯಗಳು[index]; ಎಡಭಾಗ = ಅತಿದೊಡ್ಡ(ಎಡಭಾಗ, ಮೊತ್ತ); }
  ಮೊತ್ತ = 0;
  ಗಾಗಿ (ಪೂರ್ಣಾಂಕ index = ಮಧ್ಯ + 1; index <= ಮೇಲಿನ; index++) { ಮೊತ್ತ += ಮೌಲ್ಯಗಳು[index]; ಬಲಭಾಗ = ಅತಿದೊಡ್ಡ(ಬಲಭಾಗ, ಮೊತ್ತ); }
  ಹಿಂತಿರುಗಿ ಎಡಭಾಗ + ಬಲಭಾಗ;
}
ಪೂರ್ಣಾಂಕ ಉತ್ತಮ(ಪೂರ್ಣಾಂಕ ಮೌಲ್ಯಗಳು[], ಪೂರ್ಣಾಂಕ ಕೆಳಗಿನ, ಪೂರ್ಣಾಂಕ ಮೇಲಿನ) {
  ಆದರೆ (ಕೆಳಗಿನ == ಮೇಲಿನ) ಹಿಂತಿರುಗಿ ಮೌಲ್ಯಗಳು[ಕೆಳಗಿನ];
  ಪೂರ್ಣಾಂಕ ಮಧ್ಯ = (ಕೆಳಗಿನ + ಮೇಲಿನ) / 2;
  ಹಿಂತಿರುಗಿ ಅತಿದೊಡ್ಡ(ಅತಿದೊಡ್ಡ(ಉತ್ತಮ(ಮೌಲ್ಯಗಳು, ಕೆಳಗಿನ, ಮಧ್ಯ), ಉತ್ತಮ(ಮೌಲ್ಯಗಳು, ಮಧ್ಯ + 1, ಮೇಲಿನ)), ದಾಟುವಿಕೆ(ಮೌಲ್ಯಗಳು, ಕೆಳಗಿನ, ಮಧ್ಯ, ಮೇಲಿನ));
}
ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ(ಶೂನ್ಯ) { ಪೂರ್ಣಾಂಕ ಮೌಲ್ಯಗಳು[] = {-2, 1, -3, 4, -1, 2, 1, -5, 4}; ಬರೆ("%d\n", ಉತ್ತಮ(ಮೌಲ್ಯಗಳು, 0, 8)); ಹಿಂತಿರುಗಿ 0; }
