#अन्तर्भाव <stdio.h>
/* insertion sort */
पूर्णाङ्क मुख्यम्(शून्य) {
  पूर्णाङ्क मूल्यानि[] = {31, 41, 59, 26, 41, 58}, गणना_2 = 6;
  प्रति (पूर्णाङ्क अग्रिमः = 1; अग्रिमः < गणना_2; अग्रिमः++) {
    पूर्णाङ्क कुञ्जी = मूल्यानि[अग्रिमः], index = अग्रिमः - 1;
    यावत् (index >= 0 && मूल्यानि[index] > कुञ्जी) { मूल्यानि[index + 1] = मूल्यानि[index]; index--; }
    मूल्यानि[index + 1] = कुञ्जी;
  }
  प्रति (पूर्णाङ्क index = 0; index < गणना_2; index++) प्रारूप_लिख("%d ", मूल्यानि[index]);
  प्रारूप_लिख("\n");
  प्रत्यागम 0;
}
