#अन्तर्भाव <stdio.h>
/* hash table with linear probing */
पूर्णाङ्क कुञ्चिकाः[11], प्रयुक्तम्[11];
पूर्णाङ्क स्थानार्थम्(पूर्णाङ्क कुञ्जी) { पूर्णाङ्क स्थानम् = कुञ्जी % 11; यावत् (प्रयुक्तम्[स्थानम्] && कुञ्चिकाः[स्थानम्] != कुञ्जी) स्थानम् = (स्थानम् + 1) % 11; प्रत्यागम स्थानम्; }
शून्य प्रविशय(पूर्णाङ्क कुञ्जी) { पूर्णाङ्क स्थानम् = स्थानार्थम्(कुञ्जी); कुञ्चिकाः[स्थानम्] = कुञ्जी; प्रयुक्तम्[स्थानम्] = 1; }
पूर्णाङ्क अन्तर्भवति(पूर्णाङ्क कुञ्जी) { प्रत्यागम प्रयुक्तम्[स्थानार्थम्(कुञ्जी)]; }
पूर्णाङ्क मुख्यम्(शून्य) {
  पूर्णाङ्क मूल्यानि[] = {22, 1, 13, 11, 24, 33, 18, 42, 31};
  प्रति (पूर्णाङ्क index = 0; index < 9; index++) प्रविशय(मूल्यानि[index]);
  प्रति (पूर्णाङ्क स्थानम् = 0; स्थानम् < 11; स्थानम्++) प्रारूप_लिख("%d ", प्रयुक्तम्[स्थानम्] ? कुञ्चिकाः[स्थानम्] : -1);
  प्रारूप_लिख("\n%d %d\n", अन्तर्भवति(42), अन्तर्भवति(5));
  प्रत्यागम 0;
}
