#अन्तर्भाव <stdio.h>
/* 0/1 knapsack, bottom up */
पूर्णाङ्क मुख्यम्(शून्य) {
  पूर्णाङ्क मूल्यम्[] = {60, 100, 120}, भारः[] = {10, 20, 30}, गणना_2 = 3, क्षमता = 50, श्रेष्ठम्[51] = {0};
  प्रति (पूर्णाङ्क वस्तु = 0; वस्तु < गणना_2; वस्तु++)
    प्रति (पूर्णाङ्क अवकाशः = क्षमता; अवकाशः >= भारः[वस्तु]; अवकाशः--)
      यदि (श्रेष्ठम्[अवकाशः - भारः[वस्तु]] + मूल्यम्[वस्तु] > श्रेष्ठम्[अवकाशः]) श्रेष्ठम्[अवकाशः] = श्रेष्ठम्[अवकाशः - भारः[वस्तु]] + मूल्यम्[वस्तु];
  प्रारूप_लिख("%d\n", श्रेष्ठम्[क्षमता]);
  प्रत्यागम 0;
}
