#ਅਨ੍ਤਰ੍ਭਾਵ <stdio.h>
/* maximum subarray sum, divide and conquer */
ਪੂਰਨ ਸਭ_ਤੋਂ_ਵੱਡਾ(ਪੂਰਨ ਪਹਿਲਾ, ਪੂਰਨ ਦੂਜਾ) { ਵਾਪਸ ਪਹਿਲਾ > ਦੂਜਾ ? ਪਹਿਲਾ : ਦੂਜਾ; }
ਪੂਰਨ ਪਾਰ(ਪੂਰਨ ਮੁੱਲ[], ਪੂਰਨ ਨੀਵਾਂ, ਪੂਰਨ ਵਿਚਕਾਰ, ਪੂਰਨ ਉੱਚਾ) {
  ਪੂਰਨ ਜੋੜ = 0, ਖੱਬਾ = -100000, ਸੱਜਾ = -100000;
  ਲਈ (ਪੂਰਨ index = ਵਿਚਕਾਰ; index >= ਨੀਵਾਂ; index--) { ਜੋੜ += ਮੁੱਲ[index]; ਖੱਬਾ = ਸਭ_ਤੋਂ_ਵੱਡਾ(ਖੱਬਾ, ਜੋੜ); }
  ਜੋੜ = 0;
  ਲਈ (ਪੂਰਨ index = ਵਿਚਕਾਰ + 1; index <= ਉੱਚਾ; index++) { ਜੋੜ += ਮੁੱਲ[index]; ਸੱਜਾ = ਸਭ_ਤੋਂ_ਵੱਡਾ(ਸੱਜਾ, ਜੋੜ); }
  ਵਾਪਸ ਖੱਬਾ + ਸੱਜਾ;
}
ਪੂਰਨ ਉੱਤਮ(ਪੂਰਨ ਮੁੱਲ[], ਪੂਰਨ ਨੀਵਾਂ, ਪੂਰਨ ਉੱਚਾ) {
  ਜੇ (ਨੀਵਾਂ == ਉੱਚਾ) ਵਾਪਸ ਮੁੱਲ[ਨੀਵਾਂ];
  ਪੂਰਨ ਵਿਚਕਾਰ = (ਨੀਵਾਂ + ਉੱਚਾ) / 2;
  ਵਾਪਸ ਸਭ_ਤੋਂ_ਵੱਡਾ(ਸਭ_ਤੋਂ_ਵੱਡਾ(ਉੱਤਮ(ਮੁੱਲ, ਨੀਵਾਂ, ਵਿਚਕਾਰ), ਉੱਤਮ(ਮੁੱਲ, ਵਿਚਕਾਰ + 1, ਉੱਚਾ)), ਪਾਰ(ਮੁੱਲ, ਨੀਵਾਂ, ਵਿਚਕਾਰ, ਉੱਚਾ));
}
ਪੂਰਨ ਮੁੱਖ(ਖਾਲੀ) { ਪੂਰਨ ਮੁੱਲ[] = {-2, 1, -3, 4, -1, 2, 1, -5, 4}; ਲਿਖੋ("%d\n", ਉੱਤਮ(ਮੁੱਲ, 0, 8)); ਵਾਪਸ 0; }
