#ضمن <stdio.h>
/* maximum subarray sum, divide and conquer */
صحيح تر_ټولو_لوی(صحيح لومړی, صحيح دوهم) { أرجع لومړی > دوهم ? لومړی : دوهم; }
صحيح تېرېدنه(صحيح ارزښتونه[], صحيح ټیټ, صحيح منځ, صحيح لوړ) {
  صحيح مجموعه = 0, کیڼ_اړخ = -100000, ښی_اړخ = -100000;
  لكل (صحيح index = منځ; index >= ټیټ; index--) { مجموعه += ارزښتونه[index]; کیڼ_اړخ = تر_ټولو_لوی(کیڼ_اړخ, مجموعه); }
  مجموعه = 0;
  لكل (صحيح index = منځ + 1; index <= لوړ; index++) { مجموعه += ارزښتونه[index]; ښی_اړخ = تر_ټولو_لوی(ښی_اړخ, مجموعه); }
  أرجع کیڼ_اړخ + ښی_اړخ;
}
صحيح غوره(صحيح ارزښتونه[], صحيح ټیټ, صحيح لوړ) {
  إذا (ټیټ == لوړ) أرجع ارزښتونه[ټیټ];
  صحيح منځ = (ټیټ + لوړ) / 2;
  أرجع تر_ټولو_لوی(تر_ټولو_لوی(غوره(ارزښتونه, ټیټ, منځ), غوره(ارزښتونه, منځ + 1, لوړ)), تېرېدنه(ارزښتونه, ټیټ, منځ, لوړ));
}
صحيح اصلي(فراغ) { صحيح ارزښتونه[] = {-2, 1, -3, 4, -1, 2, 1, -5, 4}; چاپ_کړه("%d\n", غوره(ارزښتونه, 0, 8)); أرجع 0; }
