#ಅನ್ತರ್ಭಾವ <stdio.h>
#ಅನ್ತರ್ಭಾವ <string.h>
/* longest common subsequence length */
ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ(ಶೂನ್ಯ) {
  ಅಕ್ಷರ ಮೊದಲ[] = "AGGTAB", ಎರಡನೇ[] = "GXTXAYB";
  ಪೂರ್ಣಾಂಕ ಅಡ್ಡಸಾಲುಗಳು = ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(ಮೊದಲ), ಲಂಬಸಾಲು_ಸಂಖ್ಯೆ = ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(ಎರಡನೇ), ಕೋಷ್ಟಕ[16][16] = {{0}};
  ಗಾಗಿ (ಪೂರ್ಣಾಂಕ ಅಡ್ಡಸಾಲು = 1; ಅಡ್ಡಸಾಲು <= ಅಡ್ಡಸಾಲುಗಳು; ಅಡ್ಡಸಾಲು++)
    ಗಾಗಿ (ಪೂರ್ಣಾಂಕ ಲಂಬಸಾಲು = 1; ಲಂಬಸಾಲು <= ಲಂಬಸಾಲು_ಸಂಖ್ಯೆ; ಲಂಬಸಾಲು++)
      ಕೋಷ್ಟಕ[ಅಡ್ಡಸಾಲು][ಲಂಬಸಾಲು] = ಮೊದಲ[ಅಡ್ಡಸಾಲು - 1] == ಎರಡನೇ[ಲಂಬಸಾಲು - 1] ? ಕೋಷ್ಟಕ[ಅಡ್ಡಸಾಲು - 1][ಲಂಬಸಾಲು - 1] + 1
                      : (ಕೋಷ್ಟಕ[ಅಡ್ಡಸಾಲು - 1][ಲಂಬಸಾಲು] > ಕೋಷ್ಟಕ[ಅಡ್ಡಸಾಲು][ಲಂಬಸಾಲು - 1] ? ಕೋಷ್ಟಕ[ಅಡ್ಡಸಾಲು - 1][ಲಂಬಸಾಲು] : ಕೋಷ್ಟಕ[ಅಡ್ಡಸಾಲು][ಲಂಬಸಾಲು - 1]);
  ಬರೆ("%d\n", ಕೋಷ್ಟಕ[ಅಡ್ಡಸಾಲುಗಳು][ಲಂಬಸಾಲು_ಸಂಖ್ಯೆ]);
  ಹಿಂತಿರುಗಿ 0;
}
