#ਅਨ੍ਤਰ੍ਭਾਵ <stdio.h>
/* merge sort, top down */
ਖਾਲੀ ਮਿਲਾਓ(ਪੂਰਨ ਮੁੱਲ[], ਪੂਰਨ ਖੱਬਾ, ਪੂਰਨ ਵਿਚਕਾਰ, ਪੂਰਨ ਸੱਜਾ) {
  ਪੂਰਨ ਆਰਜ਼ੀ[64], ਪਹਿਲਾ = ਖੱਬਾ, ਦੂਜਾ = ਵਿਚਕਾਰ + 1, ਅਗਲਾ = 0;
  ਜਦੋਂ (ਪਹਿਲਾ <= ਵਿਚਕਾਰ && ਦੂਜਾ <= ਸੱਜਾ) ਆਰਜ਼ੀ[ਅਗਲਾ++] = ਮੁੱਲ[ਪਹਿਲਾ] <= ਮੁੱਲ[ਦੂਜਾ] ? ਮੁੱਲ[ਪਹਿਲਾ++] : ਮੁੱਲ[ਦੂਜਾ++];
  ਜਦੋਂ (ਪਹਿਲਾ <= ਵਿਚਕਾਰ) ਆਰਜ਼ੀ[ਅਗਲਾ++] = ਮੁੱਲ[ਪਹਿਲਾ++];
  ਜਦੋਂ (ਦੂਜਾ <= ਸੱਜਾ) ਆਰਜ਼ੀ[ਅਗਲਾ++] = ਮੁੱਲ[ਦੂਜਾ++];
  ਲਈ (ਪੂਰਨ index = 0; index < ਅਗਲਾ; index++) ਮੁੱਲ[ਖੱਬਾ + index] = ਆਰਜ਼ੀ[index];
}
ਖਾਲੀ ਮਿਲਾਓ_ਛਾਂਟੋ(ਪੂਰਨ ਮੁੱਲ[], ਪੂਰਨ ਖੱਬਾ, ਪੂਰਨ ਸੱਜਾ) {
  ਜੇ (ਖੱਬਾ >= ਸੱਜਾ) ਵਾਪਸ;
  ਪੂਰਨ ਵਿਚਕਾਰ = (ਖੱਬਾ + ਸੱਜਾ) / 2;
  ਮਿਲਾਓ_ਛਾਂਟੋ(ਮੁੱਲ, ਖੱਬਾ, ਵਿਚਕਾਰ); ਮਿਲਾਓ_ਛਾਂਟੋ(ਮੁੱਲ, ਵਿਚਕਾਰ + 1, ਸੱਜਾ); ਮਿਲਾਓ(ਮੁੱਲ, ਖੱਬਾ, ਵਿਚਕਾਰ, ਸੱਜਾ);
}
ਪੂਰਨ ਮੁੱਖ(ਖਾਲੀ) {
  ਪੂਰਨ ਮੁੱਲ[] = {38, 27, 43, 3, 9, 82, 10}, ਗਿਣਤੀ_2 = 7;
  ਮਿਲਾਓ_ਛਾਂਟੋ(ਮੁੱਲ, 0, ਗਿਣਤੀ_2 - 1);
  ਲਈ (ਪੂਰਨ index = 0; index < ਗਿਣਤੀ_2; index++) ਲਿਖੋ("%d ", ਮੁੱਲ[index]);
  ਲਿਖੋ("\n");
  ਵਾਪਸ 0;
}
