#అన్తర్భావ <stdio.h>
/* linear algebra: LU decomposition (Doolittle) of a 3 by 3 matrix */
పూర్ణాంకం ప్రధాన(శూన్య) {
  ద్విగుణ మాతృక[3][3] = {{2, -1, -2}, {-4, 6, 3}, {-4, -2, 8}}, క్రింది[3][3] = {{0}}, పై[3][3] = {{0}};
  కొరకు (పూర్ణాంకం అడ్డువరుస = 0; అడ్డువరుస < 3; అడ్డువరుస++) {
    కొరకు (పూర్ణాంకం నిలువు = అడ్డువరుస; నిలువు < 3; నిలువు++) {
      ద్విగుణ కూడిక = 0;
      కొరకు (పూర్ణాంకం index = 0; index < అడ్డువరుస; index++) కూడిక += క్రింది[అడ్డువరుస][index] * పై[index][నిలువు];
      పై[అడ్డువరుస][నిలువు] = మాతృక[అడ్డువరుస][నిలువు] - కూడిక;
    }
    క్రింది[అడ్డువరుస][అడ్డువరుస] = 1;
    కొరకు (పూర్ణాంకం క్రింద = అడ్డువరుస + 1; క్రింద < 3; క్రింద++) {
      ద్విగుణ కూడిక = 0;
      కొరకు (పూర్ణాంకం index = 0; index < అడ్డువరుస; index++) కూడిక += క్రింది[క్రింద][index] * పై[index][అడ్డువరుస];
      క్రింది[క్రింద][అడ్డువరుస] = (మాతృక[క్రింద][అడ్డువరుస] - కూడిక) / పై[అడ్డువరుస][అడ్డువరుస];
    }
  }
  కొరకు (పూర్ణాంకం అడ్డువరుస = 0; అడ్డువరుస < 3; అడ్డువరుస++) రాయి("%g %g %g | %g %g %g\n", క్రింది[అడ్డువరుస][0], క్రింది[అడ్డువరుస][1], క్రింది[అడ్డువరుస][2], పై[అడ్డువరుస][0], పై[అడ్డువరుస][1], పై[అడ్డువరుస][2]);
  తిరిగి 0;
}
