#అన్తర్భావ <stdio.h>
/* maximum subarray sum, divide and conquer */
పూర్ణాంకం అతిపెద్ద(పూర్ణాంకం మొదటి, పూర్ణాంకం రెండవ) { తిరిగి మొదటి > రెండవ ? మొదటి : రెండవ; }
పూర్ణాంకం దాటడం(పూర్ణాంకం విలువలు[], పూర్ణాంకం దిగువ, పూర్ణాంకం మధ్య, పూర్ణాంకం ఎగువ) {
  పూర్ణాంకం కూడిక = 0, ఎడమవైపు = -100000, కుడివైపు = -100000;
  కొరకు (పూర్ణాంకం index = మధ్య; index >= దిగువ; index--) { కూడిక += విలువలు[index]; ఎడమవైపు = అతిపెద్ద(ఎడమవైపు, కూడిక); }
  కూడిక = 0;
  కొరకు (పూర్ణాంకం index = మధ్య + 1; index <= ఎగువ; index++) { కూడిక += విలువలు[index]; కుడివైపు = అతిపెద్ద(కుడివైపు, కూడిక); }
  తిరిగి ఎడమవైపు + కుడివైపు;
}
పూర్ణాంకం ఉత్తమ(పూర్ణాంకం విలువలు[], పూర్ణాంకం దిగువ, పూర్ణాంకం ఎగువ) {
  ఒకవేళ (దిగువ == ఎగువ) తిరిగి విలువలు[దిగువ];
  పూర్ణాంకం మధ్య = (దిగువ + ఎగువ) / 2;
  తిరిగి అతిపెద్ద(అతిపెద్ద(ఉత్తమ(విలువలు, దిగువ, మధ్య), ఉత్తమ(విలువలు, మధ్య + 1, ఎగువ)), దాటడం(విలువలు, దిగువ, మధ్య, ఎగువ));
}
పూర్ణాంకం ప్రధాన(శూన్య) { పూర్ణాంకం విలువలు[] = {-2, 1, -3, 4, -1, 2, 1, -5, 4}; రాయి("%d\n", ఉత్తమ(విలువలు, 0, 8)); తిరిగి 0; }
