#ਅਨ੍ਤਰ੍ਭਾਵ <stdio.h>
#ਅਨ੍ਤਰ੍ਭਾਵ <string.h>
/* longest common subsequence length */
ਪੂਰਨ ਮੁੱਖ(ਖਾਲੀ) {
  ਅੱਖਰ ਪਹਿਲਾ[] = "AGGTAB", ਦੂਜਾ[] = "GXTXAYB";
  ਪੂਰਨ ਪੰਕਤੀਆਂ = ਲੜੀ_ਲੰਬਾਈ(ਪਹਿਲਾ), ਖਾਨੇ_ਗਿਣਤੀ = ਲੜੀ_ਲੰਬਾਈ(ਦੂਜਾ), ਸਾਰਣੀ[16][16] = {{0}};
  ਲਈ (ਪੂਰਨ ਪੰਕਤੀ = 1; ਪੰਕਤੀ <= ਪੰਕਤੀਆਂ; ਪੰਕਤੀ++)
    ਲਈ (ਪੂਰਨ ਖਾਨਾ = 1; ਖਾਨਾ <= ਖਾਨੇ_ਗਿਣਤੀ; ਖਾਨਾ++)
      ਸਾਰਣੀ[ਪੰਕਤੀ][ਖਾਨਾ] = ਪਹਿਲਾ[ਪੰਕਤੀ - 1] == ਦੂਜਾ[ਖਾਨਾ - 1] ? ਸਾਰਣੀ[ਪੰਕਤੀ - 1][ਖਾਨਾ - 1] + 1
                      : (ਸਾਰਣੀ[ਪੰਕਤੀ - 1][ਖਾਨਾ] > ਸਾਰਣੀ[ਪੰਕਤੀ][ਖਾਨਾ - 1] ? ਸਾਰਣੀ[ਪੰਕਤੀ - 1][ਖਾਨਾ] : ਸਾਰਣੀ[ਪੰਕਤੀ][ਖਾਨਾ - 1]);
  ਲਿਖੋ("%d\n", ਸਾਰਣੀ[ਪੰਕਤੀਆਂ][ਖਾਨੇ_ਗਿਣਤੀ]);
  ਵਾਪਸ 0;
}
