#అన్తర్భావ <stdio.h>
#అన్తర్భావ <string.h>
/* longest common subsequence length */
పూర్ణాంకం ప్రధాన(శూన్య) {
  అక్షరం మొదటి[] = "AGGTAB", రెండవ[] = "GXTXAYB";
  పూర్ణాంకం అడ్డువరుసలు = అక్షరశ్రేణి_పొడవు(మొదటి), నిలువుల_సంఖ్య = అక్షరశ్రేణి_పొడవు(రెండవ), పట్టిక[16][16] = {{0}};
  కొరకు (పూర్ణాంకం అడ్డువరుస = 1; అడ్డువరుస <= అడ్డువరుసలు; అడ్డువరుస++)
    కొరకు (పూర్ణాంకం నిలువు = 1; నిలువు <= నిలువుల_సంఖ్య; నిలువు++)
      పట్టిక[అడ్డువరుస][నిలువు] = మొదటి[అడ్డువరుస - 1] == రెండవ[నిలువు - 1] ? పట్టిక[అడ్డువరుస - 1][నిలువు - 1] + 1
                      : (పట్టిక[అడ్డువరుస - 1][నిలువు] > పట్టిక[అడ్డువరుస][నిలువు - 1] ? పట్టిక[అడ్డువరుస - 1][నిలువు] : పట్టిక[అడ్డువరుస][నిలువు - 1]);
  రాయి("%d\n", పట్టిక[అడ్డువరుసలు][నిలువుల_సంఖ్య]);
  తిరిగి 0;
}
