#అన్తర్భావ <stdio.h>
#అన్తర్భావ <limits.h>
/* matrix chain multiplication order */
పూర్ణాంకం ప్రధాన(శూన్య) {
  పూర్ణాంకం కొలత[] = {40, 20, 30, 10, 30}, లెక్క = 4, ఖర్చు[8][8] = {{0}};
  కొరకు (పూర్ణాంకం నిడివి = 2; నిడివి <= లెక్క; నిడివి++)
    కొరకు (పూర్ణాంకం మొదటి = 1; మొదటి + నిడివి - 1 <= లెక్క; మొదటి++) {
      పూర్ణాంకం చివరి = మొదటి + నిడివి - 1;
      ఖర్చు[మొదటి][చివరి] = గరిష్ఠ_పూర్ణాంకం;
      కొరకు (పూర్ణాంకం విభజించు = మొదటి; విభజించు < చివరి; విభజించు++) {
        పూర్ణాంకం మొత్తం = ఖర్చు[మొదటి][విభజించు] + ఖర్చు[విభజించు + 1][చివరి] + కొలత[మొదటి - 1] * కొలత[విభజించు] * కొలత[చివరి];
        ఒకవేళ (మొత్తం < ఖర్చు[మొదటి][చివరి]) ఖర్చు[మొదటి][చివరి] = మొత్తం;
      }
    }
  రాయి("%d\n", ఖర్చు[1][లెక్క]);
  తిరిగి 0;
}
