#अन्तर्भाव <stdio.h>
/* all permutations of 1..3, by swapping */
पूर्णाङ्क मूल्यानि[] = {1, 2, 3}, योगः = 0;
शून्य क्रमपरिवर्तय(पूर्णाङ्क आरम्भः) {
  यदि (आरम्भः == 3) { प्रारूप_लिख("%d%d%d ", मूल्यानि[0], मूल्यानि[1], मूल्यानि[2]); योगः++; प्रत्यागम; }
  प्रति (पूर्णाङ्क index = आरम्भः; index < 3; index++) {
    पूर्णाङ्क अस्थायी = मूल्यानि[आरम्भः]; मूल्यानि[आरम्भः] = मूल्यानि[index]; मूल्यानि[index] = अस्थायी;
    क्रमपरिवर्तय(आरम्भः + 1);
    अस्थायी = मूल्यानि[आरम्भः]; मूल्यानि[आरम्भः] = मूल्यानि[index]; मूल्यानि[index] = अस्थायी;
  }
}
पूर्णाङ्क मुख्यम्(शून्य) { क्रमपरिवर्तय(0); प्रारूप_लिख("\n%d\n", योगः); प्रत्यागम 0; }
