#ضمن <stdio.h>
/* merge sort, top down */
فراغ ملاؤ(صحيح مل[], صحيح کھبا, صحيح وچکار, صحيح سجا) {
  صحيح عارضی[64], پہلا = کھبا, دوجا = وچکار + 1, اگلا = 0;
  طالما (پہلا <= وچکار && دوجا <= سجا) عارضی[اگلا++] = مل[پہلا] <= مل[دوجا] ? مل[پہلا++] : مل[دوجا++];
  طالما (پہلا <= وچکار) عارضی[اگلا++] = مل[پہلا++];
  طالما (دوجا <= سجا) عارضی[اگلا++] = مل[دوجا++];
  لكل (صحيح index = 0; index < اگلا; index++) مل[کھبا + index] = عارضی[index];
}
فراغ ملاؤ_ترتیب_دیو(صحيح مل[], صحيح کھبا, صحيح سجا) {
  إذا (کھبا >= سجا) أرجع;
  صحيح وچکار = (کھبا + سجا) / 2;
  ملاؤ_ترتیب_دیو(مل, کھبا, وچکار); ملاؤ_ترتیب_دیو(مل, وچکار + 1, سجا); ملاؤ(مل, کھبا, وچکار, سجا);
}
صحيح مکھ(فراغ) {
  صحيح مل[] = {38, 27, 43, 3, 9, 82, 10}, گنتی = 7;
  ملاؤ_ترتیب_دیو(مل, 0, گنتی - 1);
  لكل (صحيح index = 0; index < گنتی; index++) لکھو("%d ", مل[index]);
  لکھو("\n");
  أرجع 0;
}
