#ضمن <stdio.h>
/* merge sort, top down */
فراغ ادغام(صحيح مقادیر[], صحيح طرف_چپ, صحيح میانه, صحيح طرف_راست) {
  صحيح موقت[64], اولی = طرف_چپ, دومی = میانه + 1, بعدی = 0;
  طالما (اولی <= میانه && دومی <= طرف_راست) موقت[بعدی++] = مقادیر[اولی] <= مقادیر[دومی] ? مقادیر[اولی++] : مقادیر[دومی++];
  طالما (اولی <= میانه) موقت[بعدی++] = مقادیر[اولی++];
  طالما (دومی <= طرف_راست) موقت[بعدی++] = مقادیر[دومی++];
  لكل (صحيح index = 0; index < بعدی; index++) مقادیر[طرف_چپ + index] = موقت[index];
}
فراغ ادغام_مرتب_سازی(صحيح مقادیر[], صحيح طرف_چپ, صحيح طرف_راست) {
  إذا (طرف_چپ >= طرف_راست) أرجع;
  صحيح میانه = (طرف_چپ + طرف_راست) / 2;
  ادغام_مرتب_سازی(مقادیر, طرف_چپ, میانه); ادغام_مرتب_سازی(مقادیر, میانه + 1, طرف_راست); ادغام(مقادیر, طرف_چپ, میانه, طرف_راست);
}
صحيح اصلی(فراغ) {
  صحيح مقادیر[] = {38, 27, 43, 3, 9, 82, 10}, شمار = 7;
  ادغام_مرتب_سازی(مقادیر, 0, شمار - 1);
  لكل (صحيح index = 0; index < شمار; index++) چاپ_کن("%d ", مقادیر[index]);
  چاپ_کن("\n");
  أرجع 0;
}
